<template>
    <div class="container">
        <div class="card mt-4 p-1">
            <h5 class="card-title text-center">Тестовое задание:</h5>
            <div class="card-body">
                    Сделать форму обратной связи.
                    При сохранении заявки использовать паттерн фабрика.
                    Реализовать структуру, чтобы можно было добавлять новые места для хранения заявок,
                    например другая база данных или email.
                    Изначально реализовать сохранение в базу и в файл. Саму структуру базы можно не делать.

                    Поля: имя, телефон, само обращение. Валидация данных на бекенде.

                    Что необходимо использовать:
                    - PHP 7
                    - Фреймворк Laravel или mvc фреймворк
                    - ООП (для создания заявки и места для хранения заявки)
                    - DDD для организации приложения (не обязательно)
                    - Обязательно Vuejs
            </div>
        </div>
    </div>
</template>

<script>
    export default {
        name: "Home"
    }
</script>

<style scoped>

</style>
